In [7]:
 import pandas as pd

data = [
    {"name": "Rahim",  "city": "Dhaka",        "department": "HR",         "salary": 45000},
    {"name": "Karim",  "city": "Chittagong",   "department": "IT",         "salary": 75000},
    {"name": "Selina", "city": "Dhaka",        "department": "Finance",    "salary": 90000},
    {"name": "Jamal",  "city": "Rajshahi",     "department": "Marketing",  "salary": 55000},
    {"name": "Sana",   "city": "Khulna",       "department": "IT",         "salary": 82000},
    {"name": "Tuhin",  "city": "Dhaka",        "department": "Finance",    "salary": 65000},
    {"name": "Nusrat", "city": "Sylhet",       "department": "HR",         "salary": 47000},
    {"name": "Kabir",  "city": "Barisal",      "department": "IT",         "salary": 78000},
    {"name": "Mitu",   "city": "Dhaka",        "department": "Finance",    "salary": 72000},
    {"name": "Rafi",   "city": "Khulna",       "department": "Marketing",  "salary": 52000},
    {"name": "Imran",  "city": "Sylhet",       "department": "IT",         "salary": 88000},
    {"name": "Asha",   "city": "Chittagong",   "department": "HR",         "salary": 46000},
    {"name": "Fahim",  "city": "Dhaka",        "department": "Marketing",  "salary": 61000},
    {"name": "Lima",   "city": "Rajshahi",     "department": "Finance",    "salary": 94000},
    {"name": "Bappi",  "city": "Barisal",      "department": "IT",         "salary": 81000},
    {"name": "Sadia",  "city": "Khulna",       "department": "HR",         "salary": 43000},
    {"name": "Arif",   "city": "Chittagong",   "department": "Finance",    "salary": 67000},
    {"name": "Tanvir", "city": "Sylhet",       "department": "IT",         "salary": 95000},
    {"name": "Mahir",  "city": "Dhaka",        "department": "Marketing",  "salary": 58000},
    {"name": "Ayesha", "city": "Rajshahi",     "department": "Finance",    "salary": 76000},
    {"name": "Oliver",    "city": "London",        "department": "IT",          "salary": 93000},
    {"name": "Sophia",    "city": "New York",      "department": "Finance",     "salary": 105000},
    {"name": "Liam",      "city": "Toronto",       "department": "HR",          "salary": 68000},
    {"name": "Emma",      "city": "Sydney",        "department": "Marketing",   "salary": 72000},
    {"name": "Noah",      "city": "Tokyo",         "department": "IT",          "salary": 98000},
    {"name": "Mia",       "city": "Berlin",        "department": "Finance",     "salary": 87000},
    {"name": "Ethan",     "city": "Dubai",         "department": "HR",          "salary": 64000},
    {"name": "Isabella",  "city": "Singapore",     "department": "Marketing",   "salary": 76000},
    {"name": "Lucas",     "city": "Paris",         "department": "IT",          "salary": 91000},
    {"name": "Ava",       "city": "Amsterdam",     "department": "Finance",     "salary": 89000},
]



df = pd.DataFrame(data)
df

        name        city department  salary
0      Rahim       Dhaka         HR   45000
1      Karim  Chittagong         IT   75000
2     Selina       Dhaka    Finance   90000
3      Jamal    Rajshahi  Marketing   55000
4       Sana      Khulna         IT   82000
5      Tuhin       Dhaka    Finance   65000
6     Nusrat      Sylhet         HR   47000
7      Kabir     Barisal         IT   78000
8       Mitu       Dhaka    Finance   72000
9       Rafi      Khulna  Marketing   52000
10     Imran      Sylhet         IT   88000
11      Asha  Chittagong         HR   46000
12     Fahim       Dhaka  Marketing   61000
13      Lima    Rajshahi    Finance   94000
14     Bappi     Barisal         IT   81000
15     Sadia      Khulna         HR   43000
16      Arif  Chittagong    Finance   67000
17    Tanvir      Sylhet         IT   95000
18     Mahir       Dhaka  Marketing   58000
19    Ayesha    Rajshahi    Finance   76000
20    Oliver      London         IT   93000
21    Sophia    New York    Finance  105000
22      Liam     Toronto         HR   68000
23      Emma      Sydney  Marketing   72000
24      Noah       Tokyo         IT   98000
25       Mia      Berlin    Finance   87000
26     Ethan       Dubai         HR   64000
27  Isabella   Singapore  Marketing   76000
28     Lucas       Paris         IT   91000
29       Ava   Amsterdam    Finance   89000

In [8]:
df.loc[df['city'].str.contains("Dhaka")]

      name   city department  salary
0    Rahim  Dhaka         HR   45000
2   Selina  Dhaka    Finance   90000
5    Tuhin  Dhaka    Finance   65000
8     Mitu  Dhaka    Finance   72000
12   Fahim  Dhaka  Marketing   61000
18   Mahir  Dhaka  Marketing   58000

In [9]:
df.loc[df['city'].str.contains("dhaka", case=False)]

      name   city department  salary
0    Rahim  Dhaka         HR   45000
2   Selina  Dhaka    Finance   90000
5    Tuhin  Dhaka    Finance   65000
8     Mitu  Dhaka    Finance   72000
12   Fahim  Dhaka  Marketing   61000
18   Mahir  Dhaka  Marketing   58000

In [10]:
df.loc[df['city'].str.contains(r"^Raj")]

      name      city department  salary
3    Jamal  Rajshahi  Marketing   55000
13    Lima  Rajshahi    Finance   94000
19  Ayesha  Rajshahi    Finance   76000

In [11]:
df.loc[df['city'].str.contains(r"a$")]

      name    city department  salary
0    Rahim   Dhaka         HR   45000
2   Selina   Dhaka    Finance   90000
4     Sana  Khulna         IT   82000
5    Tuhin   Dhaka    Finance   65000
8     Mitu   Dhaka    Finance   72000
9     Rafi  Khulna  Marketing   52000
12   Fahim   Dhaka  Marketing   61000
15   Sadia  Khulna         HR   43000
18   Mahir   Dhaka  Marketing   58000

In [12]:
df.loc[df['city'].str.contains(r"^[AEIOU]")]

   name       city department  salary
29  Ava  Amsterdam    Finance   89000

In [13]:
df.loc[df['city'].str.contains(r"New|LOS")]

      name      city department  salary
21  Sophia  New York    Finance  105000